#include <stdio.h>

// Ֆունկցիա, որը ստուգում է, արդյոք թիվը պարզ է
int isPrime(int num) {
    // Հիմնական պարամետրեր
    if (num <= 1) return 0; // 1-ից ցածր կամ 1-ն ինքնին պարզ չեն
    if (num <= 3) return 1;  // 2-ն ու 3-ն պարզ թվեր են

    // Գործիքներ, որոնք չեն կարող լինել պարզ
    if (num % 2 == 0 || num % 3 == 0) return 0;

    // Ստուգում է թվի պարզությունը, սկսած 5-ից և ավելացնելով 6-ին յուրաքանչյուր քայլում
    for (int i = 5; i * i <= num; i += 6) {
        if (num % i == 0 || num % (i + 2) == 0) return 0;
    }

    return 1;
}

int main() {
    int num;

    // Օգտատիրոջից ներմուծում ենք թիվը
    printf("Մուտքագրեք թիվը ստուգելու համար: ");
    scanf("%d", &num);

    // Ստուգում ենք, արդյոք թիվը պարզ է
    if (isPrime(num)) {
        printf("%d թիվը պարզ է.\n", num);
    } else {
        printf("%d թիվը պարզ չէ.\n", num);
    }

    return 0;
}

